# -*- coding:utf-8 -*-


PROMPT_Conflation_Section = """病历字段杂糅情况分析：
给定一下信息，判断字段内容是否语义杂糅。
病历字段语义杂糅是指该片段语义是由“全部候选字段类型”中的两个或两个以上的字段语义组合而成的。

按照下面的格式输出结果：
```json[{{"是否杂糅": "杂糅/不杂糅"}}]```

## 正在处理的章节及章节内容：
章节：{}
章节内容：{}

## 需要分析的字段及字段内容：
字段：{}
字段内容：{}

## 全部候选字段类型及含义解释：
{}"""

PROMPT_Conflation_Note = """病历章节杂糅情况分析：
给定以下病历章节，请分析该章节是否语义杂糅。
病历章节语义杂糅是指该章节的内容是由多个不同病历章节组合而成的。
注意，杂糅的章节类型仅能是“参考章节类型”中给出的类型，杂糅的章节也可以是相同类型。

回答问题时直接给出答案(杂糅/不杂糅)。

按照下面的格式输出结果：
```json[{{"是否杂糅": "杂糅/不杂糅"}}]```

## 目标章节：    
{}

## 参考章节类型：
{}"""

PROMPT_Duplication_Note = """病历章节重复情况分析：
判断目标病历章节是否重复：
章节重复是指该章节中所有字段内容都出现两次或两次以上。
注意个别字段的重复不能算作章节重复，仅当所有字段内容都重复的时候才能算作章节重复。

回答问题时直接给出答案(重复/不重复)。

按照下面的格式输出结果：
```json[{{"是否重复": "重复/不重复"}}]```

## 目标病历：    
{}"""  # 金标注的字段内容，原始字典。排除结构化大片段

PROMPT_Duplication_Section = """病历字段重复情况分析：
结合所有字段内容，判断病历字段“{}”的内容:
“{}”
在字典所有key中是否重复。字段重复是指该该字段内容同时出现在字典中的多个字段中，或在某个字段中出现多次。

回答问题时直接给出答案(重复/不重复)。

按照下面的格式输出结果：
```json[{{"是否重复": "重复/不重复"}}]```

## 所有字段内容：    
{}"""  # 金标注的字段内容，原始字典。排除结构化大片段



PROMPT_Name_Error_Note = """病历章节名称错误情况分析：
结合章节含义解释，判断病历章节对应的标签是否正确。
## 病历章节“{}”
## 对应的标签“{}”

章节标签正确是指，在所有候选标签集中，当前标签能够最准确的描述该章节的内容。
回答问题时直接给出答案(正确/不正确)。

按照下面的格式输出结果：
```json[{{"是否正确": "正确/不正确"}}]```

## 候选标签集：
{}"""  # 原始字段内容

PROMPT_Name_Error_Section = """病历字段名称错误情况分析：
结合字段含义解释，判断病历字段对应的标签是否正确。
## 病历字段“{}”
## 对应的字段标签“{}”,标签含义“{}”
字段标签正确是指，在所有候选标签集中，当前标签能够最准确的描述该片段的内容。
回答问题时直接给出答案(正确/不正确)。

按照下面的格式输出结果：
```json[{{"是否正确": "正确/不正确"}}]```

## 候选标签集：
{}"""  # 原始字段内容


PROMPT_incomplate_Section = """字段内容完整性分析：
有以下预测字段内容和金标注字段内容：
## 原始语境：“{}”
## 目标字段标签：“{}”，字段解释：“{}”
## 预测字段内容：“{}”
判断预测字段内容语义是否完整。
语义完整是指原始语境中的所有对应的“目标字段标签”语义都完整的出现在“预测字段内容”中。
以下情况可以认为预测字段语义是完整的：
- 原始语境中除了预测字段的内容外，没有其他的内容适合归类到该“目标字段标签”中。
- 预测字段内容可能包含一些其他类型的字段语义，但目标字段类型的语义是完整的。

回答问题时直接给出答案(完整/不完整)。

按照下面的格式输出结果：
```json[{{"语义是否完整": "完整/不完整"}}]```"""

PROMPT_incomplate_Note = """章节内容完整性分析：

有以下预测的章节内容和金标注章节内容：

## 原始语境：“{}”
## 预测章节：“{}”
## 目标章节类型：“{}”,目标章节解释：“{}”。
判断预测章节语义是否完整。
语义完整是指原始语境中的所有对应的目标章节类型的语义都完整的出现在预测章节中。
但以下情况可以认为预测章节语义是完整的：
- 原始语境中除了预测章节的内容外，没有其他的内容适合归类到该目标章节类型中。
- 预测章节内容可能包含一些其他类型的章节语义，但目标章节类型的语义是完整的。

回答问题时直接给出答案(完整/不完整)。

按照下面的格式输出结果：
```json[{{"语义是否完整": "完整/不完整"}}]```"""